import re
import random


WORD = re.compile(r"""[\w|'|`]+""", re.I | re.U)
SEQUENCE = re.compile(r""".*?[.!?]""", re.I | re.U)


def tokenize_text(text):
    """Return list of tokens"""
    result = []
    for seq in SEQUENCE.finditer(text):
        result.append(list(map(str.lower, WORD.findall(seq.group(0)))))
    return result


def generate_bigram(tokens, tokenized=False):
    if not tokenized:
        tokens = tokenize_text(tokens)
    graph = {}
    for seq in tokens:
        if not seq: continue
        prev_token, current_token = None, None
        for token in seq:
            prev_token, current_token = current_token, token.lower()
            if prev_token not in graph:
                graph[prev_token] = {}
            if current_token not in graph[prev_token]:
                graph[prev_token][current_token] = 1
            else:
                graph[prev_token][current_token] += 1
    for prob in graph.values():
        prob_sum = sum(prob.values())
        for key in prob:
            prob[key] = round(prob[key]  / prob_sum, 4)

    return graph

def get_word(tokens, bigram):
    token = tokens[-1] if tokens else None
    prob = random.random()
    if token not in bigram: return None
    prob_list = list(bigram[token].items())
    if not prob_list: return None
    s, index = prob_list[0][1], 0
    while prob > s:
        index += 1; s += prob_list[index][1]
    return prob_list[index][0]


def get_sentence(bigram):
    sentence = []
    while True:
        word = get_word(sentence, bigram)
        if not word:
            sentence[0] = sentence[0].capitalize()
            sentence[-1] = sentence[-1] + '.'
            return ' '.join(sentence)
        sentence.append(word)


if __name__ == '__main__':
    text = """Філосо́фія шту́чного інтеле́кту — наука, що задається питаннями про «мислення машин», розглядає питання:
    Чи може машина діяти розумно? Чи може вона вирішувати проблеми, які людина вирішує за допомогою міркувань?
    Чи може машина мати розум, свідомість, психічний стан у тій мірі, у якій ними володіє людина. Чи може вона відчувати?
    Чи однакова природа людського і штучного інтелекту (ШІ)? Чи є у своїй основі людський мозок комп'ютером?
Ці питання відображають інтереси різних дослідників штучного інтелекту, філософів, дослідників пізнавальної (когнітивної) діяльності. Відповіді на ці питання залежать від того, що розуміється під поняттями «інтелекту» або «свідомості», і які саме «машини» є предметом обговорення.
Чи може машина мислити?
Найпалкіші суперечки у філософії штучного інтелекту викликаються питанням можливості мислення витвору людських рук. Питання «Чи може машина мислити?», що підштовхнуло дослідників до створення науки про моделювання людського розуму, було поставлене Аланом Тюрінгом в 1950 році. Дві основних точки зору на це питання носять назви гіпотез сильного й слабкого штучного інтелекту.
Термін «сильний штучний інтелект» увів Джон Серль, його ж словами підхід і характеризується:
Більше того, така програма буде не просто моделлю розуму; вона в буквальному значенні слова сама й буде розумом, у тому ж значенні, у якому людський розум — це розум.
Навпаки, прихильники слабкого ШІ воліють розглядати програми лише як інструмент, що дозволяє вирішувати ті або інші завдання, які не вимагають повного спектра людських пізнавальних здібностей.
У своєму уявному експерименті «Китайська кімната», Джон Серль показує, що навіть проходження тесту Тюрінга може не бути достатнім критерієм наявності в машини справжнього процесу мислення.
Мислення є процесом обробки інформації, що перебуває в пам'яті: аналіз, синтез і самопрограмування.[джерело?]
Аналогічну позицію займає й Роджер Пенроуз, що у своїй книзі «Новий розум короля» аргументує неможливість одержання процесу мислення на основі формальних систем.
Що вважати інтелектом?
Існують різні точки зору на це питання. Аналітичний підхід припускає аналіз вищої нервової діяльності людини до найнижчого, неподільного рівня (функція вищої нервової діяльності, елементарна реакція на зовнішні подразники (стимули), подразнення синапсів сукупності зв'язаних функцією нейронів) і наступне відтворення цих функцій. Існує визначення інтелекту як здатності вирішити інтелектуальні завдання. Тут під інтелектуальним завданням розуміється те завдання, у якого не існує відомого алгоритму розв'язання. Тобто завдання, для якого потрібно створити алгоритм із нуля. Наприклад, доведення недоведеної теореми, наукове відкриття, художня діяльність тощо. Деякі фахівці за інтелект приймають здатність раціонального, мотивованого вибору, в умовах нестачі інформації. Тобто інтелектуальною просто вважається та програма діяльності (не обов'язково реалізована на сучасних ЕОМ), що зможе вибрати з певної множини альтернатив, наприклад, куди йти у випадку «ліворуч підеш ...», «праворуч підеш ...», «прямо підеш ...».
Етичні проблеми створення штучного розуму
Цей розділ містить питання, що стосуються штучного інтелекту й етики.
    Якщо в майбутньому машини зможуть міркувати, усвідомлювати себе й мати почуття, то що тоді робить людину людиною, а машину — машиною?
    Якщо в майбутньому машини зможуть усвідомлювати себе й мати почуття, чи можливо буде їх експлуатувати або доведеться наділяти їх правами?
    Якщо в майбутньому машини зможуть міркувати, то як складуться відносини людей і машин? Дане питання було не раз розглянуте у творах мистецтва на прикладі протистояння людей і машин. Приміром, батлеріанський джихад у романі "Дюна" Френка Герберта, проблеми взаємини з Іскинами в романі Дена Сімонса "Гіперіон", війна з машинами в кінофільмі "Термінатор" тощо.
    Чи буде людина, якій у результаті численних медичних ампутацій замінили 99 відсотків тіла на штучні органи, то вона буде вважатися людиною або машиною?
Дані питання розглядаються в рамках філософії техніки і трансгуманістичної філософії.
"""
    result = generate_bigram(text)
    s = []
    while True:
        w = get_word(s, result)
        if not w: break
        s.append(w)
    print(s)